{"data":{"site":{"siteMetadata":{"title":"","author":"Kyle Alwyn"}},"markdownRemark":{"id":"d5f89ced-84a6-5c1a-85af-5da61a95922a","excerpt":"Not only was Benjamin Franklin a brilliant scientist, but also an avid philosopher and businessman. Check out his  Wikipedia page  to view…","html":"<p>Not only was Benjamin Franklin a brilliant scientist, but also an avid philosopher and businessman. Check out his <a href=\"https://en.wikipedia.org/wiki/Benjamin_Franklin\">Wikipedia page</a> to view the full list of his titles. As a pioneer and thought leader of his time, he came up with a list of virtues that he attempted to abide by in his daily living. I’ve copied them here for my own regular reminder to distill only the matterful in this age of information overload and excess.</p>\n<hr>\n<ol>\n<li><strong>Temperance</strong>. Eat not to dullness; drink not to elevation.</li>\n<li><strong>Silence</strong>. Speak not but what may benefit others or yourself; avoid trifling conversation.</li>\n<li><strong>Order</strong>. Let all your things have their places; let each part of your business have its time.</li>\n<li><strong>Resolution</strong>. Resolve to perform what you ought; perform without fail what you resolve.</li>\n<li><strong>Frugality</strong>. Make no expense but to do good to others or yourself; i.e., waste nothing.</li>\n<li><strong>Industry</strong>. Lose no time; be always employ’d in something useful; cut off all unnecessary actions.</li>\n<li><strong>Sincerity</strong>. Use no hurtful deceit; think innocently and justly, and, if you speak, speak accordingly.</li>\n<li><strong>Justice</strong>. Wrong none by doing injuries, or omitting the benefits that are your duty.</li>\n<li><strong>Moderation</strong>. Avoid extremes; forbear resenting injuries so much as you think they deserve.</li>\n<li><strong>Cleanliness</strong>. Tolerate no uncleanliness in body, cloaths, or habitation.</li>\n<li><strong>Tranquillity</strong>. Be not disturbed at trifles, or at accidents common or unavoidable.</li>\n<li><strong>Chastity</strong>. Rarely use venery but for health or offspring, never to dullness, weakness, or the injury of your own or another’s peace or reputation.</li>\n<li><strong>Humility</strong>. Imitate Jesus and Socrates.</li>\n</ol>\n<hr>\n<p>These thirteen virtues were Franklin’s own personal commandments, whose worth has proven to be unaffected by the progression of time. They are common directives I aim to implement in my life in my active pursuit of simplicity and happiness. Cheers!</p>","frontmatter":{"title":"Benjamin Franklin's 13 Virtues","date":"December 12, 2016","description":"Interpreting the virtues Benjamin Franklin instilled in his own life."}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"benjamin-franklins-13-virtues","previous":{"frontmatter":{"slug":"keeping-functions-pure","title":"Writing Pure Functions in Javascript"}},"next":{"frontmatter":{"slug":null,"title":"What is Artificial Intelligence?"}}}}