{"data":{"site":{"siteMetadata":{"title":"Kyle Alwyn","author":"Kyle Alwyn"}},"markdownRemark":{"id":"1fa93b04-25d4-5cd6-9e66-548f5f7c714a","excerpt":"Overview The documentation is a little confusing when it comes to project pages, as opposed to user pages. It feels like you should have to…","html":"<h2>Overview</h2>\n<p>The documentation is a little confusing when it comes to project pages, as opposed to user pages. It feels like you should have to do more, but actually the process is very easy.</p>\n<p>It involves:</p>\n<ul>\n<li>Setting up 2 static A records for the naked (no www) domain.</li>\n<li>Creating one CNAME record for www which will point to a GitHub URL. This will handle www redirection for you.</li>\n<li>Creating a file called CNAME (capitalised) in your project root in your site repository. This will tell Github what URL to respond to.</li>\n<li>Wait for everything to propagate.</li>\n</ul>\n<h2>What You Get</h2>\n<p>Your content will be served from a URL of the form <code class=\"language-text\">http://kylealwyn.com</code>.</p>\n<p>Visiting <a href=\"http://www.kylealwyn.com\">http://www.kylealwyn.com</a> will return a 301 redirect to the naked domain. The path will be respected by the redirect, so traffic to <a href=\"http://www.kylealwyn.com/pomodoro\">http://www.kylealwyn.com/pomodoro</a> will be redirected to <a href=\"http://www.kylealwyn.com/pomodoro\">http://kylealwyn.com/pomodoro</a>. You can have one project page per repository, so if your repos are open, you can have as many as you like.</p>\n<h2>The Process</h2>\n<p><strong>1. Create your site github repository</strong></p>\n<p>Github will, by default, serve your website if you setup a a repository named githubusername.github.io. Github username is, you guessed it your github username. My github username is kylealwyn, so I created a respository dubbed <a href=\"https://github.com/kylealwyn/kylealwyn.github.io\">kylealwyn.github.io</a>. This site’s code is hosted in the master branch of that repository. All you need to test your new Github-powered website is an index.html file.</p>\n<p><strong>2. Create a CNAME file</strong></p>\n<p>Add a file called CNAME to the root of your new repository. This should contain the domain you want to serve and nothing more. No http:// and no www. Make sure you commit and push.</p>\n<div class=\"gatsby-highlight\" data-language=\"shell\"><pre class=\"language-shell\"><code class=\"language-shell\">kylealwyn.com</code></pre></div>\n<p><strong>3. Create A records</strong></p>\n<p>This step and the next will require you to login to your domain name provider. For the A records, point @ to the following ip addresses:</p>\n<p>@: 192.30.252.154</p>\n<p>@: 192.30.252.153</p>\n<p>These are the static Github IP addresses from which your content will be served.</p>\n<p><strong>4. Create a CNAME Record</strong></p>\n<p>For the CNAME record, point www to githubusername.github.io. Note the trailing period. Also note that this is your github username. You don’t need to specify the project name yet. Github will use the CNAME file to determine which project to serve content from.</p>\n<p>e.g.</p>\n<p>www: kylealwyn.github.io.</p>\n<p>The purpose of the CNAME is to redirect all www subdomain traffic to a GitHub page which will 301 redirect to the naked domain. This file tells GitHub to use this repo to handle traffic to this domain.</p>\n<p><strong>5. Wait</strong></p>\n<p>Now wait 5 minutes, possibly even longer in some cases, and your project page should now be live.</p>\n<h2>Done!</h2>\n<p>Your website should now be available at the domain you configured. Please feel free to shoot me an email or leave me a comment if this did not make sense or you need any extra help. Cheers!</p>","frontmatter":{"title":"How To Setup Github Pages","date":"January 10, 2018","description":"A detailed description on how to setup a Github Pages website with a custom domain."}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"how-to-setup-github-pages","previous":{"frontmatter":{"slug":"benjamin-franklins-13-virtues","title":"Benjamin Franklin's 13 Virtues"}},"next":null}}