{"data":{"site":{"siteMetadata":{"title":""}},"allMarkdownRemark":{"edges":[{"node":{"excerpt":"When to use Recently, I’ve been doing a lot of http polling in my factories and services\nand I’ve needed to reflect the new data that comes…","fields":{"slug":"/2015-11-12-watching-factory-values-in-angular/"},"frontmatter":{"date":null,"title":"Watching Factory Values In Angular","description":"Learn how to watch Angular Factories and Services when they are updated"}}},{"node":{"excerpt":"Take a break When a task or problem is stumping you, just take a break. The more you look at the problem, the deeper the hole you will dig…","fields":{"slug":"/2016-02-11-life-hacks-truths-and-values/"},"frontmatter":{"date":null,"title":"Life Hacks, Truths & Values","description":"Pragmatic and timeless advice for all ages compiled over my short lifetime"}}},{"node":{"excerpt":"Recently, I needed a good way to find out exactly what had changed between two objects in an Angular application. Soooo, I wrote one. As an…","fields":{"slug":"/2016-04-07-finding-differences-in-javascript-objects/"},"frontmatter":{"date":null,"title":"Finding Differences in Javascript Objects","description":"Learn how to find the difference between two javascript objects"}}},{"node":{"excerpt":"Apart from frameworks, I’ve seen Sass maps used very little in production code bases. Sass maps allow you to define a variable containing…","fields":{"slug":"/2016-04-26-using-sass-maps/"},"frontmatter":{"date":null,"title":"Using Sass Maps","description":"Learn what Sass maps are and how to use them to reduce source code and create frameworks"}}},{"node":{"excerpt":"Let’s face it. It can be overwhelming starting at a blank terminal thinking of how to initially get our server going. I’ve been playing…","fields":{"slug":"/2016-05-29-setting-up-an-ubuntu-server/"},"frontmatter":{"date":null,"title":"Setting Up An Ubuntu Server","description":"The basic building blocks of setting up an Ubuntu/Linux server"}}},{"node":{"excerpt":"Javascript is an everchanging language. Each new spec released comes with a myriad of new features, as well as condemning some of the old…","fields":{"slug":"/2016-06-15-top-new-es6-features/"},"frontmatter":{"date":null,"title":"Top New ES6 Features","description":"A deep dive into the new ES6 features while comparing and contrasting with ES5"}}},{"node":{"excerpt":"The Problem Occasionally, my iPhone refuses to find my macbook when attempting to connect with Airdrop. I’ve searched high and low for a…","fields":{"slug":"/2016-08-10-airdrop-not-working/"},"frontmatter":{"date":null,"title":"Airdrop Not Working?","description":"What to do when one of your Airdrop devices cannot find the other"}}},{"node":{"excerpt":"Trigger A Window Resize I needed this to have my  Chart.js  charts redraw themselves due to some odd sizings within dynamically presented…","fields":{"slug":"/2016-08-04-vanilla-javascript-tricks/"},"frontmatter":{"date":null,"title":"Vanilla Javascript Tricks","description":"A compilation of helpful Javascript snippets"}}},{"node":{"excerpt":"I’ve been perusing through Robert C. Martin’s book,  Clean Code  and I wanted to document my takeaways from the chapter on functions…","fields":{"slug":"/2016-09-09-writing-pure-functions-javascript/"},"frontmatter":{"date":null,"title":"Writing Pure Functions in Javascript","description":"Exploring the benefits of writing pure functions in Javascript"}}},{"node":{"excerpt":"After building an analytics dashboard for  Lemonaid Health  with React/Redux, I felt ready to dive into some native programming with React…","fields":{"slug":"/2016-08-25-custom-fonts-with-react-native/"},"frontmatter":{"date":null,"title":"Custom Fonts with React Native","description":"Learn how to add and use custom fonts to your React Native app."}}},{"node":{"excerpt":"What is it? At it’s core, Artificial Intelligence (AI) is the science of creating smart machines that can learn on their own, rather than…","fields":{"slug":"/2017-02-03-what-is-ai/"},"frontmatter":{"date":null,"title":"What is Artificial Intelligence?","description":"A brief dive into Artificial Intelligence & Machine Learning"}}},{"node":{"excerpt":"I’ve decided to start adding sources to my posts to give credit where credit is due  1 . The solution is simple but wanted to document in…","fields":{"slug":"/2016-04-20-adding-footnotes-in-markdown/"},"frontmatter":{"date":null,"title":"Adding Footnotes in Markdown","description":"Adding footnotes in Jekyll blogs is helpful when referencing sources that do not need to be directly within content."}}},{"node":{"excerpt":"After working on the front end of apps for a few years, I’ve decided to take a deeper dive into the data that I’m displaying. What better…","fields":{"slug":"/2016-03-20-getting-started-with-SQL/"},"frontmatter":{"date":null,"title":"Getting Started With SQL","description":"Learning the basics of SQL programming and Database querying"}}},{"node":{"excerpt":"Overview The documentation is a little confusing when it comes to project pages, as opposed to user pages. It feels like you should have to…","fields":{"slug":"/2018-01-10-how-to-setup-github-pages/"},"frontmatter":{"date":null,"title":"How To Setup Github Pages","description":"A detailed description on how to setup a Github Pages website with a custom domain."}}},{"node":{"excerpt":"Not only was Benjamin Franklin a brilliant scientist, but also an avid philosopher and businessman. Check out his  Wikipedia page  to view…","fields":{"slug":"/2016-12-12-benjamin-franklins-13-virtues/"},"frontmatter":{"date":null,"title":"Benjamin Franklin's 13 Virtues","description":"Interpreting the virtues Benjamin Franklin instilled in his own life."}}},{"node":{"excerpt":"I am currently enrolled in the California Program for Entrepreneurs, and we recently discussed business plans and models. I figured I would…","fields":{"slug":"/2015-09-02-the-business-plan/"},"frontmatter":{"date":"September 02, 2015","title":"The Business Plan","description":"A business plan outline"}}}]}},"pageContext":{"isCreatedByStatefulCreatePages":true}}