{"data":{"site":{"siteMetadata":{"title":"Kyle Alwyn","author":"Kyle Alwyn"}},"markdownRemark":{"id":"37249888-0bf9-59c5-a78b-90f8cff151b9","excerpt":"Take a break When a task or problem is stumping you, just take a break. The more you look at the problem, the deeper the hole you will dig…","html":"<div class=\"alert alert-warning\">\n  <p>This is an ongoing post. Keep coming back for more life hacks, truths, and values. Newest will be at the top</p>\n</div>\n<h4>Take a break</h4>\n<p>When a task or problem is stumping you, just take a break. The more you look at the problem, the deeper the hole you will dig. It will create tunnel vision and restrict creativity. If a solution cannot be reached within an hour, step away, and let your mind wander. You will most likely find the solution immediately upon return.</p>\n<h4>Finish off interactions</h4>\n<p>Don’t leave people hanging. If someone is expecting a response, give them a response. Reply to that email, text or Facebook message and show that person you care about them.</p>\n<h4>Be the first to take action</h4>\n<p>Taking initiative in social interactions can go a long way, especially with <a href=\"http://www.inc.com/jessica-stillman/7-ways-to-make-a-killer-first-impression.html\" title=\"How to make a good first impression\">first impressions</a>. This displays a level of confidence and pride that people will revel in.</p>\n<h4>Invest in yourself</h4>\n<p>Tony Robbins, one of the greatest self development coaches, is a huge advocate of <a href=\"http://humanelevation.tonyrobbins.com/blog/money/pay-yourself-first\">this mentality</a>. Sure, it is great to think far off in the future, saving for retirement or being fiscally conservative, but you must reward yourself in the present. As a recent graduate, I am paying off loads of student loans, but I must also invest in myself along the way. Be smart about allocating your resources, but sometimes, it’s okay to splurge.</p>\n<h4>Pay for quality</h4>\n<p>I’ll admit that I was once an Amazon addict. I would find the cheapest deals on clothes, backpacks, food, etc. It feels great to get a good deal, but you’ll pay for it in the long run. It will break, tear, or not provide you with what you need.</p>\n<h4>Constantly Learn</h4>\n<p>Maintain a “rookie mindset.” It will help you keep an edge. The internet contains an abundance of resources to further your knowledge. It is okay to proclaim yourself an expert in certain matters, but it would be ignorant to believe you know all there is to know.</p>\n<blockquote>\n<p>I know one thing: that I know nothing\n<cite>Socrates</cite></p>\n</blockquote>\n<h4>Read books</h4>\n<h4>Learn how to tell a story</h4>\n<h4>Figure out your bare necessities</h4>\n<p>Determine your baseline of survival. Make note of the things you deem essential to your life. Once you create this master list, everything else becomes a want, not a need. It will make it easier to cut out excess in times of peril or struggle.</p>\n<h4>Stay in touch with friends</h4>\n<p>Life will get in the way and make it incredibly difficult to maintain friendships. This is inevitable. I urge you, however, to find the time to maintain your relationships. I’ve heard of too many elders with tragic stories of losing their friendships because they were caught up in the franticness of life.</p>\n<h4>Make new friends</h4>\n<p>Apart from keeping old friends, branch out and extend your social network. This does not mean hopping on Facebook and adding the first 5 people you see. Introduce yourself to someone at the grocery store or on the train ride to work. Attend a local meet up event pertaining to one of your interests. You’ll never know where these newfound relationships will take you or what doors they will open up.</p>\n<h4>Write</h4>\n<p>Get those thoughts out of your head. We cause ourselves unnecessary stress by trying to retain too much information. <a href=\"http://www.amazon.com/Moleskine-Classic-Notebook-Large-Notebooks/dp/8883701127/ref=lp_1069756_1_4?s=office-products&#x26;ie=UTF8&#x26;qid=1456298198&#x26;sr=1-4\" title=\"Moleskin Notebook\">Get a simple notebook</a> and just write. If you’re lacking inspiration or cannot think of what to write, check out <a href=\"http://fourhourworkweek.com/2015/01/15/morning-pages/\" title=\"Tim Ferris Morning Journal\">Tim Ferris’ morning journal</a> or start a <a href=\"http://greatergood.berkeley.edu/article/item/tips_for_keeping_a_gratitude_journal\" title=\"Gratitude Journal Example\">gratitude journal</a>. Not only will this provoke your creative process, but it will relax your mind, body and soul. Give it a try!</p>\n<h4>Write reminders</h4>\n<p>Reminders are critical for peace of mind. Decrease your cognitive load by keeping several notepads around the house, carrying a small notebook, or using your smartphone and sync your notes to the cloud for access on all devices. These methods will relieve you of stress and in turn, make you more efficient, guaranteed.</p>\n<h4>Keep a 20 in your car</h4>\n<p>This <strong>will</strong> get you out of a jam at some point. You’ll thank yourself later, trust me.</p>\n<h4>Never be satisfied</h4>\n<p>Enjoy what you have, but know you can attain more. I like to repeat a mantra in the mornings and before I fall asleep. It goes something like:</p>\n<blockquote>\n<p>I am good, but I can be better. I am smart, but I can be smarter. I am strong, but I can be stronger.</p>\n</blockquote>\n<p>This affirms your strengths, but also signals to the brain that it is not at max capacity. Do not give yourself false ceilings, for we must rise and keep rising.</p>\n<h4>Say please and thank you</h4>\n<p>We do not show each other enough appreciation. We’ve come to <em>expect</em> things and have become incredibly self-centered as a race. This is largely due to the <a href=\"http://www.bbc.co.uk/newsbeat/article/27810059/has-social-media-made-young-people-more-selfish\">rise of social media</a> and our focus shifting to how we are represented to the world, rather than how the world should be represented to us.</p>\n<h4>Learn how to learn</h4>\n<h4>Focus</h4>\n<p>Follow one course until success\nFail until failing becomes success</p>\n<h4>You can always make a change</h4>\n<p>This is something my grandmother has told me since birth</p>\n<h4>Find your burning desire</h4>\n<p>Thomas Edison took 10,000 tries to make the light bulb a success. Michael Jordan lifted weights at 6am on game days.</p>\n<h4>Make goals</h4>\n<p>We need destinations. Sure, not all those who wander are lost, but the majority of the time, wouldn’t it be nice to know where you are heading? Create goals for yourself, whether it be daily, weekly, monthly, annually etc. Put what you want and desire into your subconscious and your brain will more often than not make it happen. You’ll begin to subconsciously make decisions that will bring your closer to your goals without you even knowing it. Write them down in Evernote</p>","frontmatter":{"title":"Life Hacks, Truths & Values","date":"February 11, 2016","description":"Pragmatic and timeless advice for all ages compiled over my short lifetime"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"life-hacks-truths-values","previous":{"frontmatter":{"slug":"how-to-watch-factory-values-angular","title":"How to watch Factory values in Angular.js"}},"next":{"frontmatter":{"slug":"getting-started-with-sql","title":"Getting Started With SQL"}}}}